Healthy_Food/src/InformationRegisters/РезультатыВзвешивания/РезультатыВзвешивания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыВзвешивания</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическоеЛицо</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Healthy_Food/src/InformationRegisters/РезультатыВзвешивания/ManagerModule.bsl
#Если Сервер ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьВес(ФизическоеЛицо, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	РезультатыВзвешиванияСрезПоследних.Вес
	|ИЗ
	|	РегистрСведений.РезультатыВзвешивания.СрезПоследних(&ДатаВзвешивания, ФизическоеЛицо = &ФизическоеЛицо) КАК
	|		РезультатыВзвешиванияСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаВзвешивания", ?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата));
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение НСтр("ru = 'Для этого физического лица не результатов взвешивания.'");
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Вес;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
